project/test_automation/hilton-exp/.svn/pristine/f1/f15cedf64d9c23dfa50a865bafdd78437a6174ae.svn-base

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<Interface xmlns="http://www.hilton.com/ota/header" Name="HiltonTransactionEngine" Version="2.1">
			<PayloadInfo RequestId="f6c2e4d6-7a50-4b11-8e6a-be577dd5beb1" RequestorId="Expedia" ResponderId="Hilton">
				<CommDescriptor DestinationId="HiltonTxnEngine" SourceId="DerbysoftSwitch">
					<Authentication Password="je@8O2_p" Username="expedia.com"/>
				</CommDescriptor>
				<PayloadDescriptor Name="OTA_HotelAvailRQ" Version="3.0"/>
			</PayloadInfo>
		</Interface>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<OTA_HotelAvailRQ xmlns="http://www.opentravel.org/OTA/2003/05" SearchCacheLevel="Live">
			<AvailRequestSegments>
				<AvailRequestSegment>
					<StayDateRange Duration="P1D" Start="2018-07-10"/>
					<RoomStayCandidates>
						<RoomStayCandidate Quantity="1">
							<GuestCounts IsPerRoom="true">
								<GuestCount AgeQualifyingCode="10" Count="1"/>
							</GuestCounts>
						</RoomStayCandidate>
					</RoomStayCandidates>
					<HotelSearchCriteria>
						<Criterion>
							<HotelRef HotelCode="CHIOH"/>
						</Criterion>
					</HotelSearchCriteria>
				</AvailRequestSegment>
			</AvailRequestSegments>
		</OTA_HotelAvailRQ>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>